Repository: isroilovismoiljon/talabajon_flutter
Catalog: lib/core/l10n/arb/app_*.arb
Languages: uz

# welcome_talabajon
source: Welcome to Talabajon
uz: Talabajon ilovasiga xush kelibsiz

# please_select_language_for_app
source: Please select a language for the app
uz: Iltimos, ilova uchun tilni tanlang

source: Create account
uz: Hisob yarating

# create_account_to_use_app
source: Create an account to use the app
uz: Ilovadan foydalanish uchun hisob yarating

source: First name
uz: Ism

source: Last name
uz: Familiya

source: Username
uz: Foydalanuvchi nomi

source: Password
uz: Parol

source: Create Profile
uz: Profil yaratish

# referral_id
source: Referral Id (Optional)
uz: Referal Id (Ixtiyoriy)

source: Enter the code
uz: Kodni kiriting

# go_to_minute
source: Go to the Telegram bot below and get your 5-minute code
uz: Quyidagi Telegram botga kiring va 5 daqiqalik kodingizni oling

source: Get the code
uz: Kodni oling

source: Verification code has been sent:
uz: Tasdiqlash kodi yuborildi:

source: Get code
uz: Kodni olish

source: Welcome to Talabajon!
uz: Talabajon ilovasiga xush kelibsiz!

# log_in_your_account_use_the_app
source: Log in to your account to use the app
uz: Ilovadan foydalanish uchun hisobingizga kiring

source: Login
uz: Kirish

source: Sign Up
uz: Ro‘yxatdan o‘tish

# already_have_account
source: Already have an account?
uz: Hisobingiz bormi?

# dont_have_account
source: Don’t have an account?
uz: Hisobingiz yo‘qmi?

# text_been_copied_clipboard
source: Text has been copied to clipboard ✅
uz: Matn buferga nusxalandi ✅

source: Balance:
uz: Balans:

source: Popularity service
uz: Ommabop xizmatlar

# prepare_presentation
source: Prepare a presentation
uz: Taqdimot tayyorlash

# do_independent_assignment
source: Do an independent assignment
uz: Mustaqil ish bajarish

# write_report
source: Write a report
uz: Referat yozish

source: Home
uz: Bosh sahifa

# balanceBottom
source: Balance
uz: Balans

source: Documents
uz: Hujjatlar

source: Settings
uz: Sozlamalar

source: My Account
uz: Mening hisobim

source: Enable Dark Mode
uz: Qorong‘i rejimni yoqish

source: Settings profile
uz: Sozlamalar profili

source: Referral system
uz: Referal tizimi

source: Introduction app
uz: Ilova haqida qisqacha

source: Share friends
uz: Do‘stlar bilan ulashish

source: Contact us
uz: Biz bilan bog‘lanish

source: Language
uz: Til

source: About
uz: Ilova haqida

source: Log Out
uz: Chiqish

source: Switch language
uz: Tilni almashtirish

source: Phone number
uz: Telefon raqami

source: Update Profile
uz: Profilni yangilash

source: Create presentation
uz: Taqdimot yaratish

source: Theme
uz: Mavzu

source: Author
uz: Muallif

source: Select Design
uz: Dizayn tanlang

source: no Photo
uz: Rasmsiz

source: with Photo
uz: Rasm bilan

# are_you_sure_you_want_logout
source: Are you sure you want to logout?
uz: Rostdan ham tizimdan chiqmoqchimisiz?

source: OK
uz: Ha

source: NO
uz: Yo‘q

source: Warning
uz: Ogohlantirish

source: Edit Profile
uz: Profilni tahrirlash
